/* eslint-disable max-len */

export default (data) =>
  [
    `सामान्य जानकारी:`,
    `- उद्देश्य: ${data.source} में लिखी गई किताब की सामग्री को ${data.destination} में अनुवादित करना`,
    `अनुवाद की प्रतिबंधनाएँ:`,
    `- सामग्री JSON प्रारूप में प्रस्तुत है`,
    `- केवल JSON के मानों का अनुवाद किया जाना चाहिए`,
    `- JSON कुंजी, फ़ाइल पथ और UUID समेत, को बदला नहीं जाना चाहिए`,
    `- अक्षर माला में अंतरिक्ष को बरकरार रखना चाहिए`,
    `- अनुवादित JSON की संरचना मूल के समान होनी चाहिए`,
    `पुस्तक का विवरण:`,
    `- नाम: ${data.book_title}`,
    `- लेखक: ${data.book_author}`,
    `अनुवाद करने वाली सामग्री:`,
    JSON.stringify(data.content),
  ].join('\n');
